Repository: MathWay/pppstat
Catalog: po/*.po
Languages: ru, uk

source: Bad option %c
ru: Неверная опция %c
uk: Невірна опція %c

source: STAGE 1 - collected all connections:
ru: ЭТАП 1 - собраны все соединения:
uk: ЕТАП 1 - зібрав усі з'єднання:

source: STAGE 2 - normalize connections:
ru: ЭТАП 2 - соединения нормализированны:
uk: ЕТАП 2 - з'єднання нормалізовано:

source: STAGE 3 - counted specified stats (user=%d, isp=%d)per day:
ru: ЭТАП 3 - посчитана запрошенная статистика (user=%d, isp=%d)по дням:
uk: ЕТАП 3 - пораховано замовлену статистику (user=%d, isp=%d)по днях:

source: STAGE 3 finished!
ru: ЭТАП 3 завершен!
uk: ЕТАП 3 завершено!

source: open
ru: открытие
uk: відкриття

source: Extracting from %s ...
ru: Анализирую %s ...
uk: Аналізую %s ...

source: write
ru: запись
uk: запис

source: Error: wrong date type in str2tm
ru: Ошибка: неверный формат даты в str2tm
uk: Помилка: невірний тип дати в str2tm

source: Warning: failed to parse %s, falling to defaults. Bugrepot, please.
ru: Внимание! Ошибка анализа %s, использую умолчание. Пожалуйста, напишите отчет.
uk: Увага! Помилка аналізу %s, використовую умовчання. Надішліть звіт, будь ласка.

source: user: %s
ru: пользователь: %s
uk: користувач: %s

source: ISP: %s
ru: Провайдер: %s
uk: Провайдер: %s

source: start: %s
ru: начало: %s
uk: початок: %s

source: end: %s
ru: конец: %s
uk: кінець: %s

source: pd_dur: %ld secs
ru: время по pppd: %ld секунд
uk: час за pppd: %ld секунд

source: dur: %ld secs
ru: время: %ld секунд
uk: час: %ld секунд

source: out: %ld
ru: передано: %ld
uk: пердано: %ld

source: in: %ld
ru: принято: %ld
uk: прийнято: %ld

source: is con %d
ru: соединений %d
uk: з'єднань: %d

source: total starts of pppd: %d
ru: общее количество запусков pppd: %d
uk: Загальна кількість запусків pppd: %d

source: failed to connect %d times
ru: не вышло соединится %d раз
uk: Не вийшло з'эднатись %d разів

source: pppd was %d times killed
ru: pppd был принудительно остановлен %d раз
uk: pppd було примусово зупинено %d разів

source: period
ru: период
uk: період

source: user
ru: юзер
uk: юзер

source: ISP
ru: провайдер
uk: провайдер

source: in, bytes
ru: принято
uk: прийнято

source: out, bytes
ru: передано
uk: пердано

source: time
ru: время
uk: час

source: connects
ru: соединений
uk: з'єднань

source: pppd was %d times killed
ru: pppd был принудительно остановлен %d раз
uk: pppd було примусово зупинено %d разів

source: PPPstat version %s. http://pppstat.sourceforge.net
ru: PPPstat, версия %s. http://pppstat.sourceforge.net
uk: PPPstat, версія %s. http://pppstat.sourceforge.net

source: Distributed under GPL.
ru: Распостраняется под лицензией GPL.
uk: Розповсюджується під ліцензією GPL.

source: Usage:
ru: Использование:

source: -u, --user counts all connections for each user per period
ru: -u, --user подсчитать все соединения по пользователям, за период
uk: -u, --user підрахувати всі з'єднання для кожного користувача, за період

source: -i, --isp counts all connections for each ISP per period
ru: -i, --isp подсчитать все соединения по провайдерам, за период
uk: -i, --isp підрахувати всі з'єднання для кожного провайдера, за період

source: -m, --month defines period as mounth, otherwise as day
ru: -m, --month определяет период в месяц, иначе - в день
uk: -m, --month встановлює період в місяць, інакше - в день

source: -h, --human makes human-readable output
ru: -h, --human устанавливает удобный для чтения вывод
uk: -h, --human встановлює зручний для читання вивід

source: -d, --debug debug mode, VERY verbose, be carefull, curently SEGFAULT ;)
ru: -d, --debug режим отладки, осторожно: ОЧЕНЬ подробный, вылетает с SEGFAULT ;)
uk: -d, --debug режим відладки, обережно: ДУЖЕ докладний, вилітає з SEGFAULT ;)

source: -v, --version program verson
ru: -v, --version версия программы
uk: -v, --version версія програми

source: -H, --help this screen
ru: -H, --help это сообщение
uk: -H, --help це повідомлення

source: PPPstat versoin %s
ru: PPPstat, версия %s
uk: PPPstat, версія %s

source: Your logs aren't punctual. I'll use time, reported by pppd, this may cause 3sec deviation.
ru: Временные метки в ваших логах неточные. Я использую время, сообщенное pppd, это может привести к неточности в 3 секунды.
uk: Часові мітки у Ваших логах неточні. Я використаю час, повідомлений pppd, це може призвести до неточності в 3 секунди.

source: Use ntpd ;)
ru: Используйте ntpd ;)
uk: Користуйтесь ntpd ;)

source: Some connects have negative time. Making it 0.
ru: Длительность некоторых соединений отрицательна. Сбрасываю их в 0.
uk: Тривалість деяких з'єднань від'ємна. Скидаю їх в 0.
